import random

# Якщо у нас є проста гра в монетку то реалізувати її в пайтоні дуже просто,
# робимо randint між 0 та 1, якщо випадає цифра - 0, якщо герб - 1, імовірність 50 на 50
# 
# Але якщо я хочу зробити нечесну монетку, щоб вона випадала гербом у двічі більше, тобто
# на герб імовірність буде 2/3 а на цифру 1/3
# 
# Для цього нам знадобиться random() який поверне випадкове число float між 0 та 1 
# Намалюємо візуалізацію розподілу імовірності
# 
#     Герб      Герб        Цифра
# ----------|----------|----------
#     1/3       1/3       1/3
# 
# Оскільки вся наша лінія - це 1 то ми можемо просто викликати random() і якщо воно 
# у межах (0-2/3] то це герб, а якщо у межах (2/3-1] то цифра
# 
# 



# Суть роботи в тому, що ми проходимось по масиву з імовірнісним розподілом і додаємо
# ці імовірності утворюючи новий масив sum_probability, який містить акумулюючі значення.
# На початку ми згенерували випадкове число і далі просто дивимося коли воно потрапить
# у розподіл sum_probability. Припустимо число 0.45. Перша ітерація дає 1/3 (0.33333), замало, не підходить,
# при наступній ітерації буде вже 1/3+1/3 (0.666666), підходить. Повертаємо індекс 1
def get_probable_index(probability):
  rand = random.random()
  accumulate_prob = 0
  sum_probability = []

  for prob in probability:
    accumulate_prob += prob
    sum_probability.append(accumulate_prob)


  for index, acc_prob in enumerate(sum_probability):
    if rand <= acc_prob:
      return index


  # Оскільки додавання 1/3 + 1/3 може не дати точного результату через помилку округлення, то щоб ми не застрягли на
  # 0.9999999 і ніколи не досягли 1 ми обробимо цей випадок тут. Якщо жодна з умов не виконалася, то це саме той випадок
  # і ми повертаємо останній індекс
  return len(probability) - 1



# Запуск різних випадків дял демонстрації

def run_coin_game_many_times():
  probability = [1/3, 1/3, 2/3]
  coins = ["Герб","Герб","Цифра"]

  stats = {"Герб": 0, "Цифра": 0}
  for i in range(1000):
      index = get_probable_index(probability)
      result = coins[index]
      stats[result] += 1

  # Вивід результатів
  print(f"Результати після 1000 підкидань:")
  print(f"Герб: {stats['Герб']}") # Герб: 635
  print(f"Цифра: {stats['Цифра']}") # Цифра: 365



run_coin_game_many_times()




# Цю задачу можна застосувати і для іншого, до прикладу у нас є банкомат і він має з певною
# імовірністю видавати решту банкнотою певного номіналу. Припустимо я маю банкноти [5, 10, 20, 50]
# і я хочу щоб 5 і 10 видавалися рідше ніж 20 та 50
# імовірність випадання 5 чи 10 разом така сама, як і імовірність 20 або 50 окремо

def run_coin_game_many_times():
  dollar_bills = [5, 10, 20, 50] 
  probability = [1/6, 1/6, 1/3, 2/3]

  stats = {5: 0, 10: 0, 20: 0, 50: 0}
  for i in range(1000):
      index = get_probable_index(probability)
      result = dollar_bills[index]
      stats[result] += 1

  # Вивід результатів
  print(f"Результати після 1000 підкидань:")
  print(f"Купюра  5 грн: {stats[5]}") 
  print(f"Купюра 10 грн: {stats[10]}") 
  print(f"Купюра 20 грн: {stats[20]}") 
  print(f"Купюра 50 грн: {stats[50]}")



run_coin_game_many_times()