import random
# Нехай у нас буде дошка для дартсу у формі кола з радіусом r.
# І вона вписана у квадрат із довжиною сторони 2r, відповідно площа буде 4r^2.
# 
# Задача знайти площу кола, але не користуватися формулою pi*r^2, натомість використати метод Монте-Карло.
# Головна ідея: якщо ми не можемо обчислити щось аналітично (формулами), ми можемо 
# "просимулювати" процес тисячі разів і подивитися на результат.
# 
# У нас є дротики які влучили у коло - N та дротики які влучили поза колом, але в межах квадрату - M,
# і відношення дротиків N до всіх випущених дротиків (N + M) буде те саме яе відношення площі кола до площі квадрата
# 
# f - це коефіцієнт відношення площ, ми можемо його врахувати через кількість дротиків, а потім застосувати до реальної площі
# 
# f = Sкола/Sквадрата = N/(N+M)
# Нехай A=це площа квадрата, саме у сантиметрах, а не у дротиках, тоді:
# f*A = N
# 
#


# Тепер напишемо задачу під це, я буду випадковим чином кидати дротики які мають вписатися у 
# квадрат зі стороною 2r, якщо дротик потрапив у область x^2 + y^2 = r^2 то він потрапив у коло, 
# інакше він поза колом.

def is_in_circle(x:int, y:int, r: int):
  return x**2 + y**2 <= r**2

def dartz(count: int, r: int):
  count_in_circle = 0
  count_out_circle = 0

  for i in range(count):
    # Генеруємо координати від -r до r, щоб центр кола був у (0,0), бо якщо будемо генерувати від 0 до 2r 
    # то треба буде змінити перевірку чи потрапило у коло на (x - a)^2 + (y - b)^2 <= r^2
    # Використовуємо uniform для дробних чисел та нормального розподілу
    x = random.uniform(-r, r)
    y = random.uniform(-r, r)
    is_dartz_in_circle = is_in_circle(x,y,r)
    if is_dartz_in_circle:
      count_in_circle+=1
    else:
      count_out_circle+=1
  
  f = count_in_circle/(count_out_circle + count_in_circle)
  A = 4*r**2
  return f*A

# Реальна площа кола pi*2^2 = 12.56637061
print("Площа кола з радіусом 2")
print(dartz(1000, 2)) # 12.46
print(dartz(100000, 2)) # 12.57344
print(dartz(1000000, 2)) # 12.551968


# Ми також можемо знайти pi цим шляхом 
# 
# Оскільки в даному випадку площа квадрату S1=4r^2, а площа кола S2=pi*r^2
# 4S2/S1 = 4*pi*r^2 / 4*r^2 = pi
print("Значення pi")
r = 2
S_square = 4*r**2

S_kola_1 = dartz(1000, r)
print(4*S_kola_1/S_square) # 3.128

S_kola_2 = dartz(100000, r)
print(4*S_kola_2/S_square) # 3.133

S_kola_3 = dartz(1000000, r) # 3.142252
print(4*S_kola_3/S_square)
