from sympy import FiniteSet


# Задача
# Нехай у мене буде 5 кубиків, у кожного кубика 6 граней якими він може випасти.
# Мене цікавить, яка імовірність, що я отримую число 25 якщо кину всі 5 кубиків?


# Коротка математична нотатка
# Яка імовірність що у кубика випаде число 2? 
# Треба взяти кількість подій які нам підійдуть і розділити на всі можливі події
# Тобто буде 1/6
# 
# А яка імовірність що якщо я кину два кубика я отримую 6?
# Число 6 я можу отримати або через пару (4,2) або (1,5) або (3,3) або (2,4) чи (5,1).  
# А скільки всього буде пар? Треба виконати декартовий добуток 
# множини двох кубиків, і це буде 36 можливих пар, тож імовірність буде 5/36
# a = FiniteSet(1,2,3,4,5,6) 
# print(len(a*a)) # 36 
# 
# Але тут є проблемка з декартовим добутком тут 
# A={1,2,3} 
# B={1,2,3}
# Коли ми робимо AxB={(1,1), (1,2), (1,3), (2,1), (2,2), (2,3), (3,1), (3,2), (3,3)} 
# Як бачимо тут є (1,2) та (2,1) чи (1,3) та (3,1) і це логічно бо у нас спочатку може випасти на першому
# кубику 1, а на другому 2, чи навпаки на першому 2, а на другому 1. І це треба враховувати, бо це два 
# абсолютно різні шляхи

# Імовірність буде в межах від 0 - абсолютно неможливо до 1 - 100% станеться
def find_prob_exact_value(target_score: int, max_rolls:int):
  dice_set = FiniteSet(1,2,3,4,5,6) 
  all_possible_pairs = dice_set**max_rolls
  success_pair = []

  for pair in all_possible_pairs:
    if sum(pair) == target_score:
      success_pair.append(pair)
  
  return len(success_pair)/len(all_possible_pairs)

print(find_prob_exact_value(3,1)) # число 3 якщо лише 1 кубик - 0,1666666
print(find_prob_exact_value(6,2)) # число 6 якщо 2 кубики - 0.1388888 {(1,5), (2,4), (3,3), (5,1), (4,2)}
print(find_prob_exact_value(6,0)) # число 6 якщо 2 кубики - 0.0
print(find_prob_exact_value(25,4)) # число 25 якщо 4 кубики - це неможливо - 0.0
print(find_prob_exact_value(25,5)) # число 25 якщо 5 кубиків 0.01623


# А якщо я хочу знайти імовірність викинути число двома кубиками число 5 або більше?
# Просто зміню умову на sum(pair) >= target_score:
