import matplotlib.pyplot as plt
import random


# Фрактали це складні самоподібні структури які виходять з простих математичних формул. 
# В основі створення фракталу лежить геометрична трансформація, уявимо що у нас є точка
# P(x, y), на x-y площині, ми пропускаємо її через трансформацію P(x, y) -> Q(x + 1, y + 1) 
# І так точку P ми трансформували у точку Q, а її у точку Q2, а її у точку Q3 і так далі 
# 
# Але у нас буде не одне правило трансформації, а кілька різних
# Rule 1: P1 (x, y) -> P2 (x + 1, y − 1)
# Rule 2: P1 (x, y) -> P2 (x + 1, y + 1)  
# І вони застосовуються з певною імовірністю n раз у випадковому порядку
# 
# 
# Розглянемо приклад папороть Барнслі (Barnsley fern) 
# 
# У нас будуть такі правила трансформації
# Transformation 1 (0.85 probability): 
#   xₙ₊₁ = 0.85Xₙ + 0.04yₙ
#   yₙ₊₁ = −0.04xₙ + 0.85yₙ+ 1.6
# 
# Transformation 2 (0.07 probability)
#   xₙ₊₁ = 0.2xₙ − 0.26yₙ
#   yₙ₊₁ = 0.23xₙ + 0.22yₙ + 1.6
# 
# Transformation 3 (0.07 probability): 
#   xₙ₊₁ = −0.15xₙ + 0.28yₙ
#   yₙ₊₁ = 0.26xₙ + 0.24yₙ + 0.44
# 
# Transformation 4 (0.01 probability): 
#   xₙ₊₁ = 0
#   yₙ₊₁ = 0.16yₙ
# 
# Перша трансформація, обрана з найбільшою ймовірністю — а отже, і найчастіше — формує стебло та 
# нижні листки папороті. Друга та третя трансформації формують нижній листок зліва та справа відповідно, 
# а четверта трансформація формує стебло папороті.
# 
# Самоподібність у папороті Барнслі з'являється тому що наступна точка є наслідком попередньої і у нас у трансформаціях
# є зменшення масштабу. Тобто наступна точка буде така сама як попередня лише десь зменшена, десь повернути чи відзеркалена
# і так далі. Це призводить до створення самовідтворення на меншому масштабі.
# 
# Кожна з твоїх функцій transformation_n — це так звана афінна трансформація
# 
# Опис трансформацій
# 
# - Transformation 1 найбільш імовірнісна трансформація (імовірність 85%)
# Це головна сила фракталу. Вона відповідає за те, щоб папороть була високою і мала багато ярусів.
# Математика: Коефіцієнт 0.85 стискає попередню фігуру до 85% від її розміру.  Доданок +1.6 по осі 
# y зміщує цю копію вгору.
# Ефект: Ця трансформація створює копію всієї папороті, зменшену і пересунуту вгору. 
# Оскільки вона застосовується рекурсивно, вона фактично малює всі яруси листя, крім самого 
# першого (лівий і правий листок та нижня частина стебла). Transformation 1 бере всю папороть 
# (яка вже включає стебло та бічні листки від Transformation 2, TTransformation 3, Transformation4) і зменшує її, зміщує вгору.
# Важливо розуміти: кожен листочок вище по стеблу — це результат роботи Transformation 1 над результатом попередньої 
# ітерації (яка могла бути Transformation 2 або Transformation 3).
# 
# 
# - Transformation 2: "Ліве дзеркало" (Ймовірність 7%)
# Ця формула створює перший (найнижчий) листок зліва.
# Математика: Тут використовуються коефіцієнти 0.2 та 0.23. 
# Вони дуже сильно стискають усю папороть (вона стає крихітною порівняно з оригіналом).
# Ефект: Вона бере образ всієї папороті, зменшує її в кілька разів, повертає вліво і трохи віддзеркалює.
# Результат: Оскільки вона копіює "всю папороть" у маленьку зону зліва, цей бічний листок сам стає схожим 
# на цілу папороть. 
# 
# 
# - Transformation 3: "Праве дзеркало" (Ймовірність 7%)
# Це брат-близнюк другої трансформації, але для правого боку.Математика: Коефіцієнти майже такі самі, 
# як у Transformation 2, але з іншими знаками (наприклад, -0.15 для x), що змушує фігуру розвернутися в інший бік.
# Ефект: Аналогічно до Transformation 2, вона бере копію всієї структури, зменшує її і "приклеює" 
# до стебла справа.
# Результат: Симетричний листок праворуч, який також є міні-копією всієї рослини.
# 
# 
# - Transformation 4: "Основа стебла" (Ймовірність 1%)
# Це найпростіша, але необхідна трансформація.Математика: Вона занулює координату x (x = 0) і залишає 
# лише 16% від висоти y.
# Ефект: Вона буквально "сплющує" будь-яку точку в тонку вертикальну лінію біля осі y.
# Результат: Ця трансформація малює нижню частину стебла (корінь), яка з’єднує всю конструкцію з землею. 
# Без неї папороть би просто висіла в просторі, не маючи опори. Це єдина трансформація, яка не залежить 
# від попереднього значення x (вона занулює його)
# 
# 
# 
# Дуже цікаво що кожна з трансформацій малює свою частину папороті на всіх рівнях масштабу. Це можна наявно
# побачити, якщо додати кольори, щоб кожна трансформація відображалася своїм кольором. Тоді ми побачимо
# Що 
#   - Transformation 1 найбільш імовірнісна трансформація малює більшу частину папороті (все окрім 
#     нижньої частини стебла і двох лівих листків)
#   - Transformation 2 імовірність 7% малює лівий нижній листок
#   - Transformation 3 імовірність 7% малює правий нижній листок
#   - Transformation 4 імовірність 1% малює нижню частину стебла
# Хоча кожна трансформація малює свою частину, але якщо скажімо я приберу Transformation 4 яка малює лише нижню 
# частину стебла то у мне зникне взагалі все стебло, а якщо я приберу Transformation 3 то у мене зникне вся 
# права частина папороті і верхня частина кожного листка у лівій частині.
# 
# При прибиранні якоїсь трансформації треба віддати її частину імовірності іншим і в залежності кому скільки віддамо
# зміниться і кінцева папороть. Якщо я приберу Transformation 3 і віддам всю її імовірність Transformation 2 то
# буде стебло основної папороті і листків, а якщо передамо всю її імовірність Transformation 1 то все стебло зникне
# 
# 
# Те як папороть утворюється послідовно і як формує самоподібність добре видно на анімації ./fractals/barnsley_fern_anim.py
# 
# Якщо змінити коефіцієнти параметрів у трансформаціях то можна змінити вигляд папороті, вона може бути більше 
# видовжиною чи сплюснутою, листочки можуть бути під більшим кутом чи меншим. Загалом можна дуже сильно змінити вид папороті
# 

def transformation_1(x: float, y:float):
  x1 = 0.85*x + 0.04*y
  y1 = -0.04*x + 0.85*y + 1.6

  return (x1,y1)

def transformation_2(x: float, y:float):
  x1 = 0.2*x - 0.26*y
  y1 = 0.23*x + 0.22*y + 1.6

  return (x1,y1)

def transformation_3(x: float, y:float):
  x1 = -0.15*x + 0.28*y
  y1 = 0.26*x + 0.24*y + 0.44

  return (x1,y1)

def transformation_4(x: float, y:float):
  x1 = 0
  y1 = 0.16*y

  return (x1,y1)


# Суть роботи в тому, що ми проходимось по масиву з імовірнісним розподілом і додаємо
# ці імовірності утворюючи новий масив sum_probability, який містить акумулюючі значення.
# На початку ми згенерували випадкове число і далі просто дивимося коли воно потрапить
# у розподіл sum_probability. Припустимо число 0.45. Перша ітерація дає 1/3 (0.33333), замало, не підходить,
# при наступній ітерації буде вже 1/3+1/3 (0.666666), підходить. Повертаємо індекс 1
def get_probable_index(probability):
  rand = random.random()
  accumulate_prob = 0
  sum_probability = []

  for prob in probability:
    accumulate_prob += prob
    sum_probability.append(accumulate_prob)


  for index, acc_prob in enumerate(sum_probability):
    if rand <= acc_prob:
      return index


  # Оскільки додавання 1/3 + 1/3 може не дати точного результату через помилку округлення, то щоб ми не застрягли на
  # 0.9999999 і ніколи не досягли 1 ми обробимо цей випадок тут. Якщо жодна з умов не виконалася, то це саме той випадок
  # і ми повертаємо останній індекс
  return len(probability) - 1


def draw_fractal(count: int):
  x = 0
  y = 0
  transformation_list = [transformation_1,transformation_2,transformation_3,transformation_4]
  transformation_probability = [0.85,0.07,0.07,0.01]
  # Визначаємо кольори для кожної трансформації
  # T1 - основне листя, T2/T3 - бічні гілки, T4 - стебло
  colors = ['green', 'red', 'blue', 'black']


  x_list: list[float] = []
  y_list: list[float] = []
  point_colors = [] # Список для кольору кожної точки
  
  for i in range(count):
    index = get_probable_index(transformation_probability)
    (x,y) = transformation_list[index](x,y)
    x_list.append(x)
    y_list.append(y)
    point_colors.append(colors[index])
  
  
  # 1. Створюємо вертикальне вікно (ширина 6, висота 10 дюймів)
  fig, ax = plt.subplots(figsize=(6, 10))
  
  # 2. Задаємо межі для x та y
  ax.set_xlim(-3, 3)
  ax.set_ylim(0, 11)
  # 3. Прибираємо цифри на осях для краси
  ax.axis('off')

  # цей метод малює тільки одним кольором, тож якщо нам не треба різні кольори для різних трансформацій він підійде
  # plt.plot(x_list, y_list, 'o', markersize=1, color='green')
  ax.scatter(x_list, y_list, s=0.5, c=point_colors, edgecolors='none')
  plt.show()

# draw_fractal(1000)
# draw_fractal(10000)
draw_fractal(100000)
# draw_fractal(900000)
