import matplotlib.pyplot as plt

# Мапа Енона (Hénon Map) 
# 
# У нас будуть такі правила трансформації
# Transformation 1: 
#   xₙ₊₁ = y + 1 - 1.4xₙ²
#   yₙ₊₁ = 0.3xₙ
# 
# 
# Особливістю цієї трансформації є те, що не залежно від початкової точки (тільки якщо вони не дуже віддалені) 
# після великою кількості ітерацій наші точки все одно будуть "притягуватися" до кривих ліній, це і є той 
# самий Дивний Атрактор (Strange Attractor).
# 
# Атрактор (від англ. attract — притягувати) — це множина станів, до яких система "прагне" з часом. 
# Куди б ти не поставив першу точку (якщо вона не надто далеко), вона все одно "впаде" на ці криві.
# 
# Ця структура також є фракталом, якщо будемо наближати ліній то вони будуть утворюватися з інших ліній
# 
# Для класичних a=1.4, b=0.3 існує теорема (Hubbard and Oberste-Vorth), яка каже: 
# якщо точка вилетіла за межі квадрата зі стороною 4 (тобто |x| > 2 або |y| > 2), вона вже ніколи не повернеться. 
# Це "горизонт подій". Але все, що всередині цього квадрата — це лотерея, яку вирішує тільки обчислення.
# 
# точка (1,1) знаходиться у басейні де дії притягання, але якщо взяти точку (1.2,1.2) то вона вже буде на хребті 
# і притягання не будуть діяти. Звісно для інших коефіцієнтів параметрів x та y будуть інші межі басейну
# 
# Можна змінити значення для a і b, таким чином створивши атрактори, які будуть відрізнятися від оригінального зображення.

def transformation_1(x: int, y: int): return (y + 1 - 1.4*x*x, 0.3*x)


def draw_fractal(count: int):
  x = 1
  y = 1

  points_x = []
  points_y = []

  for i in range(count):
    x1,y1 = transformation_1(x,y)
    x=x1
    y=y1

    points_x.append(x1)
    points_y.append(y1)


  fig, ax = plt.subplots()
  ax.scatter(points_x, points_y, s=0.5)

  plt.show()

# draw_fractal(200)
# draw_fractal(2000)
draw_fractal(20_000)