import matplotlib.pyplot as plt

# Візуалізація закону тяжіння
# Закон тяжіння визначається за формулою F = G*m1*m2/r^2, де
# G - гравітаційна стала
# m1,m2 - маса об'єкта 
# r - відстань між об'єктами
#
# Зробимо графік того, як змінюється (збільшується) сила притягання в залежності від того, як
# змінюється відстань між об'єктами

m1 = 0.5 # 0.5 kg
m2 = 1.5 # 1.5 kg
G = 6.674e-11 # 6.674 * 10^-11
distance = range(100,1000,50) # 100, 150, 200, 250, ... 1000
force_result = [ (m1*m2*G)/(dist*dist)  for dist in distance]

plt.plot(distance, force_result, marker='o')
plt.xlabel("Метри")
plt.ylabel("Гравітаційна взаємодія")
plt.show()