from sympy import Symbol, expand, factor, pprint, solve, symbols

# sympy - це бібліотека, що дозволяє писати рівняння у звичному для нас вигляді

x = Symbol('x')
print(x+x+1) # 2*x + 1

a = Symbol('x')
print(a+a+1) # 2*x + 1

p = x*(x + x)
print(p) # 2*x**2 - відбулося спрощення

x,y,z = symbols('x,y,z')


# expand - це функція, що нібито розкриває дужки
s = (x + 2)*(x + 3)
print(s) # (x + 2)*(x + 3) - спрощення не відбулося, бо за замовчення спрощення працює лише для базових конструкцій
print(expand(s)) # x**2 + 5*x + 6 - expand напряму вказує робити спрощення


# factor - це навпаки функція яка розкладає вираз на множники
d = x**2 + 5*x + 6 
print(factor(d)) # (x + 2)*(x + 3)

expr = x**3 + 3*x**2*y + 3*x*y**2 + y**3
print(factor(expr)) # (x + y)**3

# pprint - функція, що дозволяє виводити вирази у термінал у вигляді, як ми пишемо на папері
pprint(d) # x^2 + 5*x + 6 - але це виглядає не дуже красиво, можливо проблема саме мого термінала або windows
