from sympy import Symbol, init_printing, pprint

# ряд Меркатора, це ряд, що використовується для наближення функції ln(1+x) в околі 0.
# Цей метод для обчислення логаритму ефективний для малих значень x (-1; 1], але для більших значень ряд не зійдеться і не дасть результату.
# В цьому прикладі не враховані знаки, у нас послідовність має лише додатні члени, а по факту там чергується + та -
# x - x^2/2 + x^3/3 - x^4/4 + ...

def print_series(n):
    # Робимо зворотній порядок, щоб менший ступінь був першим, а більший другим
    init_printing(order='rev-lex')
    
    x = Symbol('x')
    series = x
    for i in range(2, n+1):
      series = series + (x**i)/i
    pprint(series)

print_series(5)