from sympy import FiniteSet

# set - це множина, і також це структура даних у пайтоні
# {1,2,3} це множина яка містить 1,2,3
# Множина не може містити дублікатів і порядок не важливий {1,2} це те семе що і  {2,1}
# Power Set (Булеан) - це множина всіх множин, це спосіб маючи множину {1,2,3} дізнатися скільки з неї
# можливо створити підмножин. Це 2^|s| тобто 2 у степені довжини множини, в нашому випадку це 2^3 = 8
# Підмножина - це множина яка є у частиною більшої множини (super set), до прикладу {2,3} є підмножиною для {1,2,3},
# а множина {1,2,3} є супер множиною для підмножини {2,3} бо містить її
#
#
#
#
#

# Створюємо множини {1,2,3}
s = FiniteSet(1, 2, 3)
# Генеруємо всі можливі підмножини
ps = s.powerset()
print(ps) # FiniteSet(EmptySet, {1}, {2}, {3}, {1, 2}, {1, 3}, {2, 3}, {1, 2, 3}) - сумарно 8 підмножин рахуючи порожню



# Об'єднання двох сетів {1, 2} U {2, 3} у результаті отримуємо новий сет {1, 2, 3}. 
s1 = FiniteSet(1, 2, 3)
s2 = FiniteSet(2, 4, 6)
print(s1.union(s2)) # {1, 2, 3, 4, 6}


# Перетинання (intersection) двох множин створює третю, яка містить спільні елементи для обох
# {1, 2} ⩀ {2, 3} = {2}
s3 = FiniteSet(1, 2) 
s4 = FiniteSet(2, 3) 
print(s3.intersect(s4)) # {2}

# Такі операції можна робити більше ніж для двох множин
a1 = FiniteSet(1, 2, 3)
a2 = FiniteSet(2, 4, 6)
a3 = FiniteSet(3, 5, 7)
print(a1.union(a2).union(a3)) # {1, 2, 3, 4, 5, 6, 7}

print(a1.intersect(a2).intersect(a3)) # EmptySet бо немає числа, яка б було б спільне для кожної множини



# Cartesian Product (Декартовий добуток)
# Декартовий добуток двох множин створює всі можливі пари, наприклад для
# {1,2} та {3,4} буде { (1,3), (1,4), (2,3), (2,4)},
d1 = FiniteSet(1,2)
d2 = FiniteSet(3,4)
d3 = d1*d2
print(d3) # ProductSet({1, 2}, {3, 4})
for sub_set in d3:
  print(sub_set) # (1,3), (2,3), (1,4), (2,4)