import matplotlib.pyplot as plt   
import matplotlib.cm as cm        

# Задача
# Згенерувати множину Мандельброта 
# 
# Будемо вважати, що наш площина x-y  лежить між точками (тобто обмежена ними) (−2.5, −1.0) та (1.0, 1.0)
# Розглянемо приклад з деталізацією 400 точок по x та y { (x₁, y₁), (x₂, y₂) ... (x₄₀₀, y₄₀₀) } 
# Щоб заповнити усю площину нам потрібні всі можливі пари цих точок, і для цього скористаємося Декартовим добутком
# (Cartesian product) який нам дасть 1600 різних пар
# 
# Розглянемо на прикладі - [(0,0), (1,1), (2,2)] Декартовий добуток буде 3x3=9 різних пар
# це дасть нам такі точки { (0,0), (0,1), (0,2), (1,0), (1,1), (1,2), (2,0), (2,1), (2,2) }
# Якщо ми нанесемо точки на координатну сітку то побачимо що ми намалювали площину квадрата зі сторонами 3x3
# А якщо використати функцію imshow то це створить нам картинку квадрата зі сторонами 3x3 та деталізацією у 9 пікселів
# 
# 
# Тепер створимо такий самий набір пікселів [[0,0,0,0...], [0,0,0,0...], ...] для нашої площини розміром 400x400
# 
# 
# Цей алгоритм, що тут реалізовано зазвичай називають алгоритмом часу втечі (escape-time algorithm). 
# Якщо максимальна кількість ітерацій досягається до того,  як модуль точки перевищить 2, така точка належить 
# до множини Мандельброта і зафарбовується в білий колір. Точки, модуль яких перевищує 2 за меншу кількість ітерацій, 
# вважаються такими, що  «втекли»; вони не належать до множини Мандельброта і зафарбовуються в чорний колір. 
# Можна експериментувати, зменшуючи та збільшуючи кількість точок  вздовж кожної осі. Зменшення кількості точок 
# призведе до зернистого зображення, тоді як збільшення — до більш детального зображення.
# 
# 
# Коли в завданні кажуть про регіон, обмежений точками (-2.5, -1.0) та (1.0, 1.0), це насправді дає всі чотири кути.
# Це просто скорочений запис, де вказують точки діагоналі прямокутника. Якщо ми намалюємо діагональ з цими точками і знатимемо
# що фігура у нас прямокутник, то ми зможемо намалювати весь прямокутник.
# 
#        y
#        ^
#        |
#   (top)1.0 +--------------------------------------+ (1.0, 1.0)
#        |   |                                      |   Права верхня
#        |   |                                      |   точка
#        |   |                                      |
#        |   |                                      |
#        |   |                                      |
#        |   |                                      |
# (bottom)-1.0+-------------------------------------+ (1.0, -1.0)
#        |   (-2.5, -1.0)                             
#        |   Ліва нижня                             
#        |       точка                              
#        |                                          
# -------+------------------------------------------+----------> x
#        | -2.5                                     1.0
#           (left)                                  (right)
# 
# 
# 
# Тож площина обмежена точками (-2.5, -1.0) та (1.0, 1.0) це буде прямокутник по осі x від -2.5 до 1,
# а по осі y від -1 до 1
# 


# За якою логікою відбувається вибір кольору для точки
# Вибір кольору напряму пов'язаний із  iteration
# У циклі while є дві умови виходу:
#   abs(z) < 2 — точка "втекла" (стала занадто великою).
#   iteration < max_iteration — ми досягли ліміту спроб, але точка все ще "тримається" (не перевищила 2).
# 
# Значення, яке записується у масив pixels[row_idx][col_idx], — це кількість ітерацій, які знадобилися, щоб зрозуміти долю точки.

# Як працює колірна мапа (cmap)?
# Функція plt.imshow разом із cmap=cm.magma працює як перекладач: вона бере число (кількість ітерацій) і зіставляє його з кольором на шкалі.
# Маленька кількість ітерацій (наприклад, 2 або 10): 
#   Точка дуже швидко "вилетіла" за межі радіуса 2. 
#   Це зони далеко від основної фігури. Вони отримають темні кольори (у палітрі Magma).
# 
# Середня кількість ітерацій (наприклад, 200): 
# Точка довго коливалася, перш ніж стати великою. 
# Це створює ті самі красиві "ореоли" та візерунки навколо множини.
# 
# Максимальна кількість ітерацій (max_iteration): 
# Програма "здалася", вважаючи, що точка належить до множини Мандельброта (чорна середина фігури).
# 
# Тож змінюючи значення iteration ми змінюємо колір фігури на виході. Менші значення охоплюються більше точок і тому фігура більш
# різнокольорова і має відгалуження та ореоли. Але чим це значення більше тим точніше ми визначаємо чи належить точка до множини бо 
# після великої кількості ітерацій точка все ще належить множині і значення iteration велике тож на кольоровій шкалі воно буде у кінці спектру 
# тобто або біле, або жовте, без відтінків
# 
# тобто якщо у нас точки мають такі значення кольорів [1,5,5,3,2,4,5,8,9] і нехай кольорова гамма буде чорно-біла, то
# 1 буде білим кольором, а 9 чорним, а все що між ними певним відтінком між білим і чорним
# 

def create_pixel_list(resolution:int, x_min:float, x_max:float, y_min: float, y_max:float):
  pixels = []
  step_x = abs(x_max-x_min)/resolution
  step_y = abs(y_max-y_min)/resolution

  for i in range(resolution):
    row = []
    for j in range(resolution):
      x = x_min + j * step_x # x лишається сталим для одного рядка, а збільшується лише коли переходимо на наступний рядок
      y = y_min + i * step_y # y лишається сталим для однієї колонки, а збільшується лише коли переходимо на наступну колонку

      row.append((x,y))
    pixels.append(row)
  
  return pixels


# Параметри вікна
x_min, x_max = -2.5, 1.0
y_min, y_max = -1.0, 1.0
resolution = 400
max_iteration = 100 # якщо поставити значення 100 то картинка буде мати ореоли і матиме менш чіткі краї

pixels = create_pixel_list(resolution,x_min,x_max,y_min,y_max)


for row_idx, row in enumerate(pixels):
  for col_idx, col in enumerate(row):
    z = 0 + 0j
    (x,y) = pixels[row_idx][col_idx]
    c = complex(x, y) # це ми так записали x + yj, де j - це уявна одиниця

    iteration = 0

    while abs(z) < 2 and iteration < max_iteration:
      z = z*z + c
      iteration+=1
    
    pixels[row_idx][col_idx] = iteration


plt.figure(figsize=(10, 7))
# Використовуємо cmap=cm.magma для гарного вигляду, або cm.binary_r для чорно-білого як в інструкції
# extent - цей параметр каже:(left, right, bottom, top)
plt.imshow(pixels, origin='lower', extent=(x_min, x_max, y_min, y_max), cmap=cm.magma, interpolation='nearest')     
plt.colorbar()
plt.title("Mandelbrot Set")
plt.show()


