import matplotlib.pyplot as plt
import numpy as np

# Це той самий код, що і у ./fractals/mandelbrot_set/mandelbrot_set.py але тут ще більш
# агресивно застосовується numpy ніж у ./fractals/mandelbrot_set/mandelbrot_set_numpy.py
# що дає більшу швидкість роботи, хоча щоб розуміти що тут написано треба краще розуміти numpy

# Параметри
x_min, x_max = -2.5, 1.0
y_min, y_max = -1.0, 1.0
res = 400 
max_iter = 1000

# Створюємо сітку значень (рівномірно розподіляємо 400 точок між min та max)
x = np.linspace(x_min, x_max, res)
y = np.linspace(y_min, y_max, res)

# .meshgrid() перетворює два одновимірні масиви (координати по осях x та y) у дві двовимірні матриці, 
# які представляють собою сітку координат для кожної точки зображення.
# Нехай є сітка 3x3 
# x = [1, 2, 3] (координати стовпців)
# y = [10, 20, 30] (координати рядків)
# Коли викликаємо X, Y = np.meshgrid(x, y), то отримуємо:
#   Матриця X (координати по горизонталі):
#   Вона дублює рядок x стільки разів, скільки елементів у y.
#   [[1, 2, 3],
#    [1, 2, 3],
#    [1, 2, 3]]
# 
#   Матриця Y (координати по вертикалі):
#   Вона дублює стовпчик y стільки разів, скільки елементів у x.
#   [[10, 10, 10],
#    [20, 20, 20],
#    [30, 30, 30]]
# 
# У нашому коді з множиною Мандельброта кожен піксель — це комплексне число c = x + yi.
# Щоб не писати два вкладені цикли for x in ... та for y in ... (що в Python працює повільно), 
# ми просто додаємо ці дві матриці: C = X + 1j * Y
# В результаті ми отримуємо одну велику матрицю C того ж розміру, де в кожній клітинці вже лежить 
# готове комплексне число для цієї конкретної точки екрана. Це дозволяє NumPy виконувати обчислення 
# над усіма 160 000 пікселями (400x400) одночасно, що в десятки разів швидше за звичайний цикл.

X, Y = np.meshgrid(x, y)
C = X + 1j * Y

# .zeros_like() створює новий масив, який заповнений нулями, але має точно такий самий розмір (shape) 
# та тип даних (dtype), як і масив C.
Z = np.zeros_like(C)

image = np.full(C.shape, max_iter, dtype=int) # За замовчуванням всі точки всередині
mask = np.full(C.shape, True, dtype=bool)

for i in range(max_iter):
    # Обчислюємо тільки для тих, хто ще не втік
    Z[mask] = Z[mask]**2 + C[mask] # аналог z = 0 + 0j
    
    # Знаходимо тих, хто втік за межі фігури саме зараз
    escaping = np.abs(Z[mask]) > 2
    
    # Витягуємо індекси точок, що втекли, відносно всієї матриці
    # і записуємо їм поточну ітерацію i
    image_indices = np.where(mask)[0][escaping], np.where(mask)[1][escaping]
    image[image_indices] = i
    
    # Оновлюємо маску (прибираємо тих, хто втік)
    mask[np.abs(Z) > 2] = False

plt.imshow(image, extent=(x_min, x_max, y_min, y_max), cmap='magma')
plt.show()