from sympy import Symbol, Integral,Derivative, sqrt

# Задача
# 
# Нехай у мене є крива яка задана функцією f(x) = 2*x² + 3*x + 1
# Я хочу знайти довжину кривої на проміжку від -5 до 10
# 
# Для того аби знайти довжину функції нам потрібно використати криволінійний інтеграл,
# щоб розбити шлях на маленькі прям відрізки які ми зможе просувати інтегралом
#     
#         /|
#    ds  / |
#       /  | ∆y
#      /   |
#      ----
#       dx
# 
# На цікавить саме ds - це буде прямолінійний відрізок шляху, тому наш інтеграл виглядатиме саме так
# a
# ∫ds
# b 
# 
# ds = √(ds² + ∆y²)
# ∆y = f'(x) * dx
# ∆y² = f'(x)² * dx²
# f'(x) = (2*x² + 3*x + 1)' = 4x + 3
# ds = √(ds² + ∆y²) = √(ds² + f'(x)² * dx²) = dx*√(1 + f'(x)²) = dx*√(1 + (4x+1)²)
# 


x = Symbol('x')
fx = 2*x**2 + 3*x + 1             # наша функція f(x)
full_fx = (1 + (4*x + 3)**2)**0.5 # повний вираз який піде під інтеграл по dx

# Можна також не рахувати самому похідну, а просто запхати функцію f(x) у Derivative, це те саме
# full_fx = (1 + Derivative(fx,x).doit()**2)**0.5

i = Integral(full_fx, (x,-5,10)).doit().evalf()
print(i) # 268.372650946022





# Це більш універсальний варіант, варто зауважити, що тут використовуємо для кореня не ступінь 0.5, а sqrt,
# але вкрай важливо щоб цей sqrt був імпортований із sympy інакше буде помилка в обрахунках і отримаємо інше число
def find_length(fx, var, a, b):
    deriv = Derivative(fx, var).doit()
    length = Integral(sqrt(1+deriv**2), (var, a, b)).doit().evalf() 
    return length

print( find_length(fx, x, -2, 15) ) # 500.26798116353