from sympy import Symbol, Derivative

# Derivative - це похідна
# Похідна записується як f'(x) або dy/dx
# 
# Похідна характеризує швидкість зміни функції відносно зміни її аргументу 
# Вона визначається як границя відношення приросту функції до приросту аргументу, коли останній прямує до нуля
# lim  ∆y/∆x = lim  ( f(x+∆x)-f(x) ) / ∆x
# ∆x->0         ∆x->0
# 
# Тобто як бачимо у виразі вище у нас є приріст функії f(x+∆x) і коли ми віднімаємо функцію до приросту (f(x)) то отримаємо
# саме приріст функції, а в низу ∆x - це приріст аргументу (x₂-x₁), за умови що ∆x наближається до 0 (∆x->0)
# 
# 
# Тобто похідна - це відношення приросту функції до приросту аргументу yx, коли цей приріст прямує до нуля. 
# А як береться приріст функції ми показали вище
# 
# Приклад: Коли автомобіль їде з прискоренням, то на спідометрі авто ти бачиш число, наприклад, 60 км/год. 
# Це твоя похідна в цей момент (швидкість). Бо це твоя швидкість саме в цю секунду
# 
# 
# Тепер уявимо що наш шлях описується функцією S(t) = 5*t^2 + 2*t + 8
# Тобто наша функція шляху S залежить від часу (t), щоб порахувати швидкість нам треба взяти звідси похідну
# За правилами похідних ми можемо порахувати,Ж що це буде 10t+2
# 
# Але ми можемо зробити це більш примітивно без математичного апарату похідних
# У нас є S(t) і буде ще одна S(t+∆t) це та сама відстань але через через ∆t який наближається до 0.
# Замінимо ∆t на δ, бо так зручніше писати
# 
# Підставимо у функцію 
# S(t) = 5*t^2 + 2t + 8
# S(t+δ) = 5*(t+δ)^2 + 2(t+δ) + 8
# S(t+δ) = 5*(t^2 + 2tδ + δ^2) + 2t + 2δ + 8
# S(t+δ) = 5*t^2 + 10tδ + 5δ^2 + 2t + 2δ + 8
# 
# Тепер у нас є S2 та S1 і час δ між ними, тож наша швидкість буде V=(S2-S1)/δ
# ∆S = S(t+δ) - S(t)
# V = ∆S/δ
# ∆S = (  (5*t^2 + 10tδ + 5δ^2 + 2t + 2δ + 8) - (5*t^2 + 2t + 8) ) 
# ∆S = 5*t^2 + 10tδ + 5δ^2 + 2t + 2δ + 8 - 5*t^2 - 2t - 8 
# ∆S =  10t*δ + 5*δ^2 + 2δ 
# 
# V = ∆S/δ
# V = (10t*δ + 5δ^2 + 2δ)/δ
# V = δ(10t + 5δ + 2)/δ
# V = 10t + 5δ + 2
# При δ->0 маємо
# V = 10t + 2 



t = Symbol('t')
St = 5*t**2 + 2*t + 8
d = Derivative(St,t)

print(d) # Derivative(5*t**2 + 2*t + 8, t)
print(d.doit()) # 10*t + 2
print(d.doit().subs({t:1})) # 12 (підставка значення t, це може бути цифрове значення, або інший Symbol)


# Ще один приклад
print('---------------------------------')
x = Symbol('x')
fx = Derivative((x**3 + x**2 + x) * (x**2 + x))
print(fx.doit()) # (2*x + 1)*(x**3 + x**2 + x) + (x**2 + x)*(3*x**2 + 2*x + 1)
print(fx.doit().subs({x:3})) # 681



# Також можна рахувати часткову похідну (коли функція залежить від кількох параметрів)
# f(x,y) = 2xy + xy^2  - функція одночасно залежить від x та y, тож візьмемо часткову похідну по x 
# ∂f/∂x = 2y + y^2
x1 = Symbol('x')
y1 = Symbol('y')
fx1 = Derivative(2*x1*y1 + x1*y1*y1, x1) # x1 тут вказує по чому брати похідну, можна було би вказати y1 якби нам треба було по цьому параметру
print(fx1.doit()) # y**2 + 2*y - це похідна по x