from sympy import Symbol, Derivative, solve
from sympy.plotting import plot

# За замовченням клас Derivative шукає похідну лише першого порядку,
# але можна вказати третім аргументом похідну якого порядку варто розрахувати
# 
# Розглянемо приклад пошуку максимуму і мінімуму функції на проміжку
# 
# нехай у нас є функція f(x) = x^5 - 30x^3 + 50x, яка визначена на області визначення [-5;5]
# Для початку намалюємо його, на щастя у sympy є можливість передати функію як аргумент і вказати 
# на якому проміжку треба її обчислити і він намалює графік (тобто не треба самому розрахувати 
# набір точок для x_values та y_values)
x = Symbol('x')
fx = x**5 - 30*x**3 + 50*x
plot(fx, (x, -5, 5), title="Символьний графік") # Малюємо графік для наочності

d = Derivative(fx, x).doit() # 5*x**4 - 90*x**2 + 50
critical_points = solve(d) # solve за замовченням шукає значення x, коли вираз = 0 
# це потенційні кандидати на екстремум
# Коли SymPy розв'язує рівняння solve(d1), він видає список коренів у тому порядку, у якому їх знайшов 
# алгоритм розв'язання. Цей порядок не зобов'язаний бути від меншого до більшого.
# Всі ці точки будуть або екстремумами або перегинами
print(critical_points) # [-sqrt(9 - sqrt(71)), sqrt(9 - sqrt(71)), -sqrt(sqrt(71) + 9), sqrt(sqrt(71) + 9)]

# Присвоїмо назви цим точкам
A = critical_points[0] 
B = critical_points[1] 
C = critical_points[2] 
D = critical_points[3]



# Ми використаємо похідну другого порядку, щоб знайти глобальні максимуми і мінімуми
d2 = Derivative(fx, x, 2).doit() # 20*x*(x**2 - 9)

# Тепер підставимо критичні точки які знайшли вище у d2 і подивимося
#   - якщо значення < 0 то це maximum
#   - якщо значення > 0 то це minimum
#   - якщо значення = 0 то це ні minimum ні maximum, це «зона невизначеності». Друга похідна надто слабка, щоб показати вигин.

# Тут видно, що точки B та C - це локальні мінімуми, а точки A та D - це локальні максимуми і ніде немає щоб d2 = 0
print(d2.subs({x: A}).evalf()) # 127.661060789073
print(d2.subs({x: B})) # -127.661060789073
print(d2.subs({x: C}).evalf()) # -703.493179468151
print(d2.subs({x: D}).evalf()) # 703.493179468151



# Тепер нам треба знайти глобальний максимум на проміжку [-5; 5]
# Для цього треба у функцію f(x) підставити точки A,B,C,D і подивитися як з них найбільша і яка найменша
# Але також треба перевірити значення на краях функції, бо він міг не потрапити у точки в яких похідна = 0, 
# тому що горбик де f'(x)=0 лежить за межами інтервалу що ми виміряємо [-5;5], але ця точка може бути все одно 
# вищою ніж екстремуми що ми знайшли.
x_min = -5 
x_max = 5

# Шукаємо глобальний максимум, в нашому випадку ми перевіряємо точки B та C та краї інтервалу x_min та x_max
# Точка C дає найбільший максимум 705.959460380365, отже вона є глобальним максимумом на проміжку [-5;5]
p_b = fx.subs({x:B}).evalf() # 25.0846626340294
p_c = fx.subs({x:C}).evalf() # 705.959460380365
p_x_min = fx.subs({x:x_min}).evalf() # 375.000000000000
p_x_max = fx.subs({x:x_max}).evalf() # -375.000000000000

# Шукаємо глобальний мінімум, в нашому випадку ми перевіряємо точки A та D та краї інтервалу x_min та x_max
# Точка D дає найменше значення -705.959460380365, отже вона є глобальним мінімум на проміжку [-5;5]
p_a = fx.subs({x:A}).evalf() # -25.0846626340294
p_d = fx.subs({x:D}).evalf() # -705.959460380365


