from sympy import Symbol, limit

# Задача 
# Потрібно написати функцію, яка буде визначати чи функція f(x) у точці x0 перервна
# 
# 
# Функція не завжди може бути неперервною, вона може перериватися або тому що в цій точці її 
# не існує (наприклад ділення на 0), або через різкий стрибок
# 
# Різкий стрибок - тут може виникнути питання, а чому власне немає переходу, от функція в точці x0 була 10,
# і раптом в точці x1 вже 5, а чому власне функції немає, у нас же просто різкий перехід, а не плавний як зазвичай,
# але тут криється помилка, бо це погляд з точки зору дискретності (де між значеннями є крок), але математичний 
# аналіз працює з безперервним простором. В математичній функції між будь-якими двома числами наприклад, 0 та 0.000001 
# існує нескінченна кількість інших чисел. Тобто між x0 та x1 які нескінченно близько один до одного, є певний стрибок,
# але він нескінченно малий, тобто це не стрибок, а плавний перехід. Звучить як абсурд, можливо це пов'язано з парадоксом 
# Зенона (про Ахілла і черепаху), що приводить нас до рядів які мають збігтися, навіть якщо їх можна нескінченно ділити навпіл
# 
# Це можна описати так
#   Неперервність (Плавність): Ти кажеш: «Я хочу, щоб значення y змінилося не більше ніж на 0.001». 
#   Математика відповідає: «Добре, тоді зроби крок по x меншим за 0.0005». Ти кажеш: «А якщо я хочу зміну лише на 10^-10?».
#   Математика: «Тоді зроби крок по x ще меншим».
#     Суть: Ти можеш зробити розрив між значеннями y наскільки завгодно малим, просто зменшуючи крок по x. 
#     Він прямує до нуля разом із твоїм кроком. 
# 
#   Розрив (Прірва): Ти кажеш: «Я хочу, щоб зміна по y була меншою за 1». 
#   А функція відповідає: «Ні. Як би близько ти не підходив по "x", значення "у" цій точці все одно стрибне рівно на 5».
# 
# Тобто можна резюмувати так:
#   Якщо можна зробити зміну по "y" наскільки завгодно малою, просто підходячи ближче по "x" — у нас плавна лінія

# Визначити чи є функція неперервною в точці допомагають ліміти (lim). Ми йдемо одночасно з двох сторін
# Розглянемо приклад, коли ми йдемо до точки x=0 з двох сторін:
#   Зліва (від від'ємних чисел): Ми йдемо по нулях. Ліміт дорівнює 0.
#   Справа (від додатних чисел): Ми йдемо по одиницях. Ліміт дорівнює 1.
# Математика каже: якщо лівий ліміт не дорівнює правому ліміту, то загального ліміту в цій точці не існує. 
# А якщо ліміту не існує — це 100% розрив. Лінія «розірвана», бо її кінці не зустрілися в одній точці.

def check_if_function_continuously(fx, x, x0):
  left_direction = limit(fx, x, x0, dir='-')
  right_direction = limit(fx, x, x0, dir='+')

  print(left_direction)
  print(right_direction)

  return left_direction == right_direction

x = Symbol('x')
fx = 1/x
print(check_if_function_continuously(fx,x,1)) # отже функція fx неперервна в точці x0=1
print(check_if_function_continuously(fx,x,0)) # отже функція fx має розрив в точці x0=0
print(check_if_function_continuously(fx,x,0.1)) # отже функція fx має розрив в точці x0=0