from sympy import Derivative, Symbol, sin, cos, pi, solve, exp
from sympy.plotting import plot
import math


# Знаходження глобального максимуму методом градієнтного підйому 
# 
# Задача 1
# Нехай у нас є функція яка описує шлях по осі x для м'яча кинутого під кутом до горизонту. 
# У нас є початкова швидкість v і кут θ під яким кинули м'яч.
# Ми хочемо знайти в якому місці функція досягає найбільшого значення (для цього випадку 
# це означатиме під яким кутом θ пройдена відстань по осі x (s_x) буде найбільшою, 
# тобто де глобальний максимум функції)



# Метод градієнтного підйому полягає в тому шо ми беремо theta скажімо 0.001 і поступово 
# наближаємося до значення theta при якому значення функції буде найбільшим
# θ_new = θ_old + λ(dR/dθ)
# λ - це крок із яким ми йдемо
# 
# Крок 1. Рахуємо θ_new за формулою вище
# Крок 2. Якщо |θ_new - θ_old| > ε, тоді θ_old = θ_new і повертаємося до кроку 1
# Крок 3. θ_new це приблизне (наближене) значення θ, для якого s_x набуває найбільшого значення
# 
# ε (epsilon) визначає йоли ми зупинимо ітерації нашого алгоритму 
# (дивитись “The Role of the Step Size and Epsilon” on page 197)
# 
# 
# Про важливість initial value x0
# У прикладі із cos(x) коли ми ставимо x_0 = 2 точка доволі далеко від максимуму, тобто нам 
# треба буде пройти весь шлях до 0, і якщо у нас буде маленький ε то це займе багато часу і ітерацій
# 
# Проблема №2
# Алгоритм градієнтного підйому зупиниться коли знайде перший горбик і зовсім не обов'язково, щоб саме він був 
# найвищим максимумом. Наприклад у нас є функція f(x) = x**5 - 30*x**3 + 50*x
# При x_0 = -2 ми отримаємо що найбільше значення функції буде 705.9594 (при x=-4.1744)
# При x_0=0.5 ми отримаємо що найбільше значення функції буде 25.0846 (при x=0.7574)
# Саме тому варто ставити x_0 на початок вашої області значень на якій ви досліджуєте функцію, або
# зробити запуск з кількох точок (це гарний приклад greedy algorithm)
# 
# 
# Про важливість Step Size та Epsilon
# 
# θ_new = θ_old + λ(dR/dθ)
# λ - це step size і він повинен бути достатньо маленьким, бо якщо буде великим ми можемо проскочити
# вершину (попередня ітерація зупинилася майже біля вершини, але наступна її перескочила), 
# але і робити його дуже маленьким теж не можна бо тоді обрахунки будуть йти достатньо довго
# 
# ε - поріг чутливості, чим він менший тим на менший горбик ми зреагуємо
# 
# В наших прикладах λ=10^-3, а ε=10^-6 

# Це треба для графіку, щоб показати як він виглядає
g = 9.8
theta_deg = Symbol('theta')
theta_rad = theta_deg * pi / 180
v = 50

u_x=v*cos(theta_rad)
t_flight=(2*v*sin(theta_rad))/g
s_x=u_x*t_flight

# p = plot(s_x, (theta_deg, 0, 90), 
#          title="Дальність польоту від кута кидання",
#          xlabel="Кут (градуси)", 
#          ylabel="Відстань Sx (метри)",
#          show=True)


# -------------------------------------------------------------------------------------
def gradient_ascent(fx_derivative, x, x0):
  # Перевіряємо чи вираз fx_derivative=0 має розв'язок, тобто чи можна похідну прирівняти до 0
  if not solve(fx_derivative):
      print('Cannot continue, solution for {0}=0 does not exist'.format(fx_derivative))
      return

  epsilon = 1e-6
  step_size = 1e-3
  x_old = x0
  x_new = x_old + step_size*fx_derivative.subs({x: x_old}).evalf()

  # з нашим s_x прикладом буде лише 5 ітерацій, а от для cos буде 2303 ітерацій із таким step_size 
  # (або треба змінити початкову точку x0, щоб зменшити кількість ітерацій) 
  # 
  # Якби fx була б лінійною то частка приросту step_size*fx.subs({x: x_old}).evalf() завжди була б однаковою 
  # (бо тоді похідна була б константою), але оскільки може бути не лінійна функція то і частки приросту 
  # можуть бути різні, якщо проходимо відтинок  з більшою кривизною то частка буд більшою бо похідна 
  # (зростання функції по відношенню до аргументу) більша, а якщо відтинок з меншою кривизною то і приріст буде менший
  while(abs(x_old - x_new) > epsilon):
    x_old = x_new
    x_new = x_old + step_size*(fx_derivative.subs({x: x_old}).evalf())

  return x_new



def find_max_theta(fx, theta):
  # Calculate the first derivative
  d = Derivative(fx, theta).doit()
  theta0 = 1e-3
  theta_max = gradient_ascent(d, theta, theta0)
  return theta_max

theta = Symbol('theta')
fx = v**2*sin(2*theta)/g # це та сама формула s_x=u_x*t_flight просто виконано математичне спрощення
theta_max = find_max_theta(fx, theta)
print('Theta: {0}'.format(math.degrees(theta_max)))            # Theta: 44.999999918501246
print('Maximum Range: {0}'.format(fx.subs({theta:theta_max}))) # Maximum Range: 255.102040816327


# Задача 2
# Знайдемо найбільше значення cos(a)
x = Symbol('x')
f_cosx = cos(x)
d_cosy = Derivative(f_cosx, x).doit()
x_0 = 0.01
max_cos_at_x = gradient_ascent(d_cosy, x, x_0)
print(max_cos_at_x) # 0.000998442301922086 (тобто найбільше значення cos набуває коли x = 0)
print(f_cosx.subs({x: max_cos_at_x})) # 0.999999501556526 (найбільше можливе значення cos - це 1)


# Задача 3
# Знайдемо найбільше значення e^x
x1 = Symbol('x')
f_ex = exp(x1)
d_ex = Derivative(f_ex, x)
x1_0 = 0.001
max_cos_at_x = gradient_ascent(d_ex, x, x1_0) # Cannot continue, solution for Derivative(exp(x), x)=0 does not exist


# Задача 4
# Знайдемо найбільше значення x**5-x**3+50*x
# x2 = Symbol('x')
# fx2 = x**5-x**3+50*x
# d2 = Derivative(fx, x).doit()

# x_new почне спочатку додаватися номально, але потім в певний момент почне скакати то вверх то вниз
# 10.67 75.23 160218.98 3.29 5.89 6.02 6.59 9.45 4.00 1.28
# 
# І буде так скакати невідомо скільки (після хвилини роботи я виключив) 
# Це пов’язано із тим, що у нас є  x5 де при невеликій зміні x у нас сильно змінюється y
# Як варіант для цього випадку треба зменшити λ, бо 10^-3 буде надто великим кроком для відтинку 
# функції де вон стрімко зростає
# x_where_fx_is_max = gradient_ascent(d,x,-2) # 
