from sympy import Symbol, exp, sqrt, pi, Integral, S

# Основи інтегралів і sympy
x = Symbol('x')
k = Symbol('k')
fx = k*x
i = Integral(fx, x).doit()
print(i) # k*x**2/2

# Тепер подивимося якщо ми задамо межі інтегралу, тобто у нас буде визначений інтеграл
i_d = Integral(fx, (x, 0, 2)).doit()
print(i_d) # 2*k



# Розглянемо задачу
# Нехай у нас є група студентів які отримали оцінки з предмету, оцінка може бути від 0 до 20, але не лише 
# в цілих числах, а в дробових, тобто оцінка – це будь яке з можливих чисел від 0 до 20. 
# А оскільки навіть між 0 і 1 нескінченна кількість чисел, то у нас можливий нескінченний вибір можливих оцінок.
# І я також не знаю самих оцінок тому побудувати графік я не можу, і відповідно функції яка описує графік теж немає.
# Необхідно визначити яка ймовірність що студент отримає оцінку в проміжку від 11 до 12.
# 
# Я припускаю що оскільки студенти живі люди і ми говоримо про реальний світ, то я роблю 
# припущення що імовірнісний розподіл оцінок – це нормальний розподіл (тобто розподіл Гаусса). 
# Це буде класична дзвіноподібна (bell curve), де більшість студентів отримають середні оцінки, 
# десь в межах 10, буде трохи відмінників які отримають 20 і двійочників які отримають 0.
# 
# Для нашого випадку крива Гаусса буде описуватися рівнянням f(x)=1/sqrt(2*pi) * e^-(x-10)^2/2
# Тепер якщо запхати цю функція під інтеграл і проінтегрувати по dx для визначеного інтеграла в межах від 11 до 12,
# то ми отримаємо площу під кривою Гаусса для точок 11 та 12. По факту це не площа, а значення накопичувальної функції
# імовірності, яка не може перевищувати 1

x = Symbol('x')
p = exp(-(x - 10)**2/2)/sqrt(2*pi)
print(Integral(p, (x, 11, 12)).doit().evalf())                  # 0.135905121983278
print(Integral(p, (x, 9, 11)).doit().evalf())                   # 0.682689492137086
print(Integral(p, (x, -S.Infinity, S.Infinity)).doit().evalf()) # 1.00000000000000
print(Integral(p, (x, 10, 10)).doit().evalf())                  # 0

# Ми також провели інтегрування і для інших точок, і побачили що в діапазон між 9 та 11 потрапить 68% всіх студентів
# 
# А якщо проінтегрувати від -∞ до +∞, то ми отримаємо всі 100%
# 
# І вельми цікаво, що якщо ми проінтегруємо лише для однієї точки 10, а не діапазону, то отримаємо імовірність 0,
# по факту вона не 0, але дуже маленька і наближається до 0, як ми пам'ятаємо між 0 і 1 є нескінченна кількість
# чисел, тому якщо у нас числа від 0 до 20 можуть бути буль які (цілі і дробові) то виходить імовірність отримати
# суто оцінку 10 буде 1/∞, тобто число яке наближатися до 0. Це логічно бо коли ми ітегруємо то наш dx це дуже маленький 
# проміжок де x наближається до 0, а в нашому випадку x - це конкретне значення оцінки, тобто це купа нескінченно малих 
# відрізків які ми сумуємо інтегралом.